000_РОЗНИЦА_ЦЕНТР/src/Reports/ТревогиПоМагазинам/ТревогиПоМагазинам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ТревогиПоМагазинам</name>
</mdclass:Report>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КартаТревог/КартаТревог.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КартаТревог</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>НазваниеТерритории</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ТипТерритории</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипТревоги</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КодТерритории</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Магазины/Магазины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Магазины</name>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВведенВЭксплуатацию</name>
    <comment>Магазин переведен в режим работы 1С:Розница</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМинимальныхЦенПродажи</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.Города</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПользователей</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФизЛиц</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПеремещении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрименениеЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрямуюИнкассацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаМагазина</name>
    <comment>Основная денежная касса магазина</comment>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>КодБюджета</name>
    <type>
      <types>CatalogRef.КодыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>КодФилиала</name>
    <comment>Navision</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьАссортимент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерМагазина</name>
    <comment>Используется для начальной загрузки из MForce</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделениеОрганизации</name>
    <comment>Определяет филиал</comment>
    <type>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменаРучныхСкидок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подпись</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОкругленияСуммыЧекаВПользуПокупателя</name>
    <type>
      <types>EnumRef.ПорядкиОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоЦенообразования</name>
    <type>
      <types>CatalogRef.ПравилаЦенообразования</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментИсключаемойНоменклатуры</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПереброски</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПоступления</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПродажи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладСвязи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладУправляющейСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматМагазина</name>
    <type>
      <types>CatalogRef.ФорматыМагазинов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ИнтервалыРаботыМагазинов/ИнтервалыРаботыМагазинов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнтервалыРаботыМагазинов</name>
  <attributes>
    <name>НачалоИнтервала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеИнтервала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаРабочегоВремени</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДниНедели</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаботыВыполняемыеСотрудниками</name>
    <attributes>
      <name>РаботаВыполняемаяСотрудниками</name>
      <type>
        <types>CatalogRef.РаботаВыполняемаяСотрудниками</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСотрудников</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Reports/ТревогиПоМагазинам/Forms/ФормаОтчета/Module.bsl
&НаСервере
Функция ПолучитьТЗДанные()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КартаТревог.Период КАК НачалоТревоги,
	               |	КартаТревог.КодТерритории КАК КодТерритории,
	               |	КартаТревог.НазваниеТерритории КАК Регион,
	               |	КартаТревог.ДатаОкончания КАК ОкончаниеТревоги,
	               |	КартаТревог.ТипТерритории КАК ТипТерритории,
	               |	КартаТревог.ТипТревоги КАК ТипТревоги,
	               |	КартаТревог.Примечание КАК Примечание,
	               |	Магазины.Ссылка КАК Магазин,
	               |	Магазины.Город КАК Город,
	               |	ИнтервалыРаботыМагазинов.НачалоИнтервала КАК НачалоРаботы,
	               |	ИнтервалыРаботыМагазинов.ОкончаниеИнтервала КАК ОкончаниеРаботы,
	               |	РАЗНОСТЬДАТ(КартаТревог.Период, КартаТревог.ДатаОкончания, МИНУТА) КАК Длительность
	               |ИЗ
	               |	Справочник.Магазины КАК Магазины
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КартаТревог КАК КартаТревог
	               |		ПО Магазины.Город.КодТерритории = КартаТревог.КодТерритории
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИнтервалыРаботыМагазинов КАК ИнтервалыРаботыМагазинов
	               |		ПО (ИнтервалыРаботыМагазинов.Магазин = Магазины.Ссылка)
	               |ГДЕ
	               |	КартаТревог.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И Магазины.ВведенВЭксплуатацию = ИСТИНА";
	Запрос.УстановитьПараметр("НачалоПериода",Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(Период.ДатаОкончания));
	вТЗ = Запрос.Выполнить().Выгрузить();

	Возврат вТЗ;
КонецФункции	

&НаСервере
Функция ОбработатьДанные(вТЗ)
	
	рТЗ = вТЗ.СкопироватьКолонки();
	
	// 2. Обходим исходную ТЗ
	Для Каждого СтрокаИсходная Из вТЗ Цикл
		
		ТекНачалоТревоги = СтрокаИсходная.НачалоТревоги;
		ТекКонецТревоги  = СтрокаИсходная.ОкончаниеТревоги;
		
		// Защита от пустых или некорректных дат
		Если Не ЗначениеЗаполнено(ТекНачалоТревоги) Или Не ЗначениеЗаполнено(ТекКонецТревоги) Тогда
			Продолжить;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(СтрокаИсходная.НачалоРаботы) ИЛИ Не ЗначениеЗаполнено(СтрокаИсходная.ОкончаниеРаботы) Тогда
			Продолжить;
		КонецЕсли;
		
		
		// Перебираем каждый календарный день по порядку от начала до конца тревоги
		ТекущийДень = НачалоДня(ТекНачалоТревоги);
		Пока ТекущийДень <= НачалоДня(ТекКонецТревоги) Цикл
			
			// Считаем рабочие часы магазина для конкретного ТекущегоДня
			// Смещаем время работы (например, 11:00) на начало текущих суток
			СекундОтНачалаДняНачало = СтрокаИсходная.НачалоРаботы - НачалоДня(СтрокаИсходная.НачалоРаботы);
			СекундОтНачалаДняКонец  = СтрокаИсходная.ОкончаниеРаботы - НачалоДня(СтрокаИсходная.ОкончаниеРаботы);
			
			РабочееНачало = ТекущийДень + СекундОтНачалаДняНачало;
			РабочийКонец  = ТекущийДень + СекундОтНачалаДняКонец;
			
			// Если магазин работает круглосуточно или закрывается на следующий день (например, с 22:00 до 06:00), 
			// здесь потребуется усложнение. Код ниже рассчитан на работу внутри одного дня.
			
			// Находим пересечение интервала тревоги и рабочего времени магазина в этот день
			ПересечениеНачало = Максимум(ТекНачалоТревоги, РабочееНачало);
			ПересечениеКонец  = Минимум(ТекКонецТревоги, РабочийКонец);
			
			// Если пересечение существует и оно корректно (начало раньше конца)
			Если ПересечениеНачало < ПересечениеКонец Тогда
				Если ПересечениеНачало < Период.ДатаНачала ИЛИ ПересечениеКонец > КонецДня(Период.ДатаОкончания) Тогда
					// Переходим к следующему дню
					ТекущийДень = ДобавитьМесяц(ТекущийДень, 0); // Безопасный сдвиг дня в 1С делается через + 86400 секунд
					ТекущийДень = ТекущийДень + 86400; 
					Продолжить;
				КонецЕсли;
				
				// Добавляем строку в результирующую ТЗ
				НоваяСтрока = рТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсходная);
				
				НоваяСтрока.НачалоТревоги    = ПересечениеНачало;
				НоваяСтрока.ОкончаниеТревоги = ПересечениеКонец;
				
				// Вычисляем длительность в минутах (разница дат в 1С дает секунды)
				НоваяСтрока.Длительность = Цел((ПересечениеКонец - ПересечениеНачало) / 60);
				
			КонецЕсли;
			
			// Переходим к следующему дню
			ТекущийДень = ДобавитьМесяц(ТекущийДень, 0); // Безопасный сдвиг дня в 1С делается через + 86400 секунд
			ТекущийДень = ТекущийДень + 86400; 
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат рТЗ;

	
КонецФункции

// Вспомогательные функции минимума и максимума для дат
Функция Максимум(Значение1, Значение2)
	Возврат ?(Значение1 > Значение2, Значение1, Значение2);
КонецФункции

Функция Минимум(Значение1, Значение2)
	Возврат ?(Значение1 < Значение2, Значение1, Значение2);
КонецФункции

&НаСервере
Процедура КомандаСформироватьНаСервере()
	
	Результат.Очистить();

	вТЗ = ПолучитьТЗДанные();
	оТЗ = ОбработатьДанные(вТЗ);
	//ТабДок = СформироватьОтчетПоТЗ(вТЗ);
	ТабДок = СформироватьОтчетПоТЗ(оТЗ);
	
	Результат.Вывести(ТабДок);    
	Элементы.Результат.ОтображениеСостояния.Видимость = Ложь;
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;	
КонецПроцедуры 

&НаСервере
Функция СформироватьОтчетПоТЗ(вТЗ)
	// Получаем макет схемы из самого отчета
	СхемаСКД = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	// Используем текущие настройки из пользовательского интерфейса
	НастройкиТекущие = Отчет.КомпоновщикНастроек.ПолучитьНастройки();

	// Инициализируем макет компоновки
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки  = КомпоновщикМакета.Выполнить(СхемаСКД, НастройкиТекущие);

	// Передаем вашу таблицу значений в структуру внешних наборов
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("вТЗ", вТЗ); // Имя ключа должно точно совпадать с "Имя объекта" в наборе данных СКД

	// Запускаем компоновку данных
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных);

	// Выводим результат в табличный документ
	ТабДок = Новый ТабличныйДокумент; // Или используйте реквизит формы Элементы.Результат
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабДок);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат ТабДок;
КонецФункции


&НаКлиенте
Процедура КомандаСформировать(Команда)
	КомандаСформироватьНаСервере();
КонецПроцедуры
